### Imports

In [1]:
import pandas as pd
from sqlalchemy import create_engine

### Store CSV into DataFrame

In [6]:
vehicle_info = "./Resources/zip_vehicle_info.csv"
vehicle_info_df = pd.read_csv(vehicle_info)

income_info = "./Resources/zip_income_info.csv"
income_info_df = pd.read_csv(income_info)

C:\Users\susan\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3165: DtypeWarning: Columns (1) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [7]:
# Checking vehicle info table
vehicle_info_df.head()

,Date,Zip Code,Model Year,Fuel,Make,Duty,Vehicles
0,10/1/2018,90000,2006,Gasoline,OTHER/UNK,Light,1
1,10/1/2018,90000,2014,Gasoline,OTHER/UNK,Light,1
2,10/1/2018,90000,2016,Gasoline,OTHER/UNK,Light,1
3,10/1/2018,90000,2017,Gasoline,OTHER/UNK,Light,1
4,10/1/2018,90000,<2006,Diesel and Diesel Hybrid,OTHER/UNK,Heavy,55

In [8]:
# Checking income info table
income_info_df.head()

  state  zipcode  total_pop  total_income country    avg_income
0    AK        0     345220      25354974     USA  73445.843230
1    AK    99501       7690        612242     USA  79615.344603
2    AK    99502      11860       1000685     USA  84374.789207
3    AK    99503       7510        462394     USA  61570.439414
4    AK    99504      19440       1176109     USA  60499.434156

### Cleaning table

In [ ]:
# Removing all states except for CA from income_info_df
income_info_df = income_info_df[income_info_df['state']=='CA']
income_info_df

### Connect to local database

In [1]:
from config import db_password
protocol = "postgres"
user = "postgres"
location = "localhost"
port = "5432"
database = "vehicle_income_zip"

connection_string = f"{protocol}://{user}:{db_password}@{location}:{port}/{database}"
print(connection_string)

postgres://postgres:postgres@localhost:5432/vehicle_income_zip